[{"header":"Business","description":"","level":1,"child":[{"header":"IT Finance ","description":"<p>> Internal IT? ISVs should have a dedicated Capability group devoted to product it</p><p>Addresses your organization’s capability to plan, allocate, and manage the budget for IT expenses given changes introduced with the cloud services consumption model.</p><p>A common budgeting change involves moving from capital asset expenditures and maintenance to consumption-based pricing. The move requires new skills to capture information and new processes to allocate cloud asset costs that accommodate consumption-based pricing models. You want to ensure that your organization maximizes the value of its cloud investments. Charge-back models are another common change with cloud adoption. Cloud services provide options to create very granular charge-back models. You will be able to track consumption with new details, which creates new opportunities to associate costs with results.</p>","level":2,"child":[{"header":"Define Operational Metrics -SaaS?-","description":"<p>> Product - not internal IT</p>","level":3,"child":[]}],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"IT Strategy ","description":"<p>> Internal IT vs Product</p><p>Focuses on your organization’s capability to leverage IT as a business enabler. For many organizations that have not yet migrated to the cloud, IT has devolved into simply ensuring that collaboration applications and line-of-business applications stay healthy and operational.</p><p>Cloud services provide efficiencies that reduce the need to maintain applications, enabling IT to focus on business alignment. This alignment requires new skills and both new and selectively modified processes between IT and other business and operational areas. IT teams may need new skills to gather business requirements and new processes to solve business challenges.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Benefits Realisation ","description":"<p>Encompasses your organization’s capability to measure</p><p>the benefits received from their IT investments. For many organizations, this</p><p>represents Total Cost of Ownership (TCO) or Return on Investment (ROI)</p><p>calculations coupled with budget management.</p><p>Quantifying and evaluating TCO and ROI changes with cloud services. Cloud</p><p>services offer new ways to directly link consumption with specific business</p><p>processes. Measuring the value of technology investments becomes more</p><p>meaningful when these investments can be directly linked to usage and business</p><p>outcomes.</p>","level":2,"child":[{"header":"Calculate TCO and ROI in Cloud","description":"","level":3,"child":[]},{"header":"Evaluate Cloud Business Case","description":"<p>> Capabilities are stable over the long-term. Validation of the cloud business case is a one of acitivity. Should not be here</p>","level":3,"child":[]},{"header":"Evaluate Cloud Economics","description":"<p>... Understanding AWS pricing and packaging mechanisms will help you optimize your architecture for cost and spend flexibility</p>","level":3,"child":[]}],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Business Risk Management ","description":"<p>Focuses on your organization’s capability to understand the business impact of preventable, strategic, and external risks to the organization. For many, these risks stem from the impact of financial and technology constraints on agility.</p><p>Organizations find that with a move to the cloud, many of these constraints are reduced or eliminated. Taking full advantage of this newfound agility requires teams to develop new skills to understand the competitive marketplace and potential disrupters, and to explore new processes for evaluating the business risks of such competitors.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Busines Strategy ","description":"","level":2,"child":[{"header":"Evaluate new Business Models","description":"<p>> Former : business modeling and future of softrare</p>","level":3,"child":[]},{"header":"Evaluate Organizational Readiness","description":"","level":3,"child":[]},{"header":"Evaluate IT Landscape Readiness","description":"<p>> Relevant for ISV?</p>","level":3,"child":[]},{"header":"Execute Transformation","description":"","level":3,"child":[]},{"header":"Manage Cloud Partnerships","description":"","level":3,"child":[]},{"header":"Define Business Model Migration Strategy","description":"<p>Organizations implementing new business models must defined the strategy to migrate the customers and sunset the old-guard business models. The strategy includes the migration of existing customers, re-evaluation of the sales and marketing partnerships and organizational transformation.</p>","level":3,"child":[]}],"badge":"ISV CAF","badgeCategory":3,"switch_value":3},{"header":"Financial Planning and Reporting ","description":"","level":2,"child":[],"badge":"ISV CAF","badgeCategory":3,"switch_value":3},{"header":"Legal ","description":"","level":2,"child":[],"badge":"ISV CAF","badgeCategory":3,"switch_value":3},{"header":"Product Strategy ","description":"","level":2,"child":[{"header":"Identify Market","description":"","level":3,"child":[]},{"header":"Identify Customer Needs","description":"","level":3,"child":[]},{"header":"Design Product Portfolio","description":"","level":3,"child":[]},{"header":"Evaluate Product-Market Fit","description":"","level":3,"child":[]},{"header":"Develop Go To Market Strategy","description":"","level":3,"child":[]},{"header":"Manage Marketing Strategy","description":"<p>Operational Marketing vs Strategic marketing</p>","level":3,"child":[]},{"header":"Manage Liability Implications","description":"<p>Legal</p>","level":3,"child":[]},{"header":"Onboard Customers","description":"<p>> PRoduct strategy or operations?</p>","level":3,"child":[]},{"header":"Offboard Customers","description":"<p>> PRoduct strategy or operations?</p>","level":3,"child":[]}],"badge":"ISV CAF","badgeCategory":3,"switch_value":3},{"header":"Sales and Distribution ","description":"<p>> Distribution?</p>","level":2,"child":[{"header":"Define Sales Strategy","description":"","level":3,"child":[]},{"header":"Define Sales Incentives ","description":"","level":3,"child":[]},{"header":"Upsell Product To Existing Customers","description":"","level":3,"child":[]},{"header":"Define Pricing Models","description":"<p>Moving from Cost-Based Pricing to Value-Based Pricing</p><p>Common SaaS Tiering Strategies</p><p>Introducing Composite/Domain-Specific Metrics</p><p>Factoring Consumption into Pricing</p><p>Mapping Pricing to Service/Business Goals</p>","level":3,"child":[]}],"badge":"ISV CAF","badgeCategory":3,"switch_value":3}]},{"header":"Product? ","description":"","level":1,"child":[{"header":"Market","description":"","level":2,"child":[]},{"header":"Customer Success ","description":"","level":2,"child":[{"header":"Handle cusomer onboarding","description":"","level":3,"child":[]},{"header":"Manage Customer Success","description":"","level":3,"child":[]},{"header":"Manage Customer Concerns","description":"","level":3,"child":[]},{"header":"Avoid Customer Churn","description":"","level":3,"child":[]},{"header":"Manage upsell","description":"","level":3,"child":[]},{"header":"Handle customer offboarding","description":"","level":3,"child":[]}]}],"badge":"New","badgeCategory":0,"switch_value":0},{"header":"People","description":"","level":1,"child":[{"header":"Resource Manamgent ","description":"<p>Addresses your organization’s capability to project personnel needs and to attract and hire the talent necessary to support the organization’s goals.</p><p>Cloud adoption requires that the staffing teams in your organization acquire new skills and processes to ensure that they can forecast and staff based on your organization’s needs. These teams need to develop the skills necessary to understand cloud technologies, and they may need to update processes for forecasting future staffing requirements.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Incentive Manamgent ","description":"<p>Addresses your organization’s capability to ensure that workers receive competitive compensation and benefits for the value they bring to your organization. With the shift to cloud, some IT roles move from being commoditized to being highly specialized with high market demand.</p><p>Incentive management is key to attracting and retaining employees. Consider incentives as part of cloud adoption work streams. Your organization’s culture and ability to provide an environment for attracting and retaining talent plays a key role in successful adoption. Teams will need to develop new skills to manage culture and new processes for talent management.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Career Management ","description":"<p>Focuses on your organization’s capability to ensure the personal fulfillment of your employees, their career opportunities, and their financial security.</p><p>Cloud adoption introduces change to IT career paths, requiring HR managers and people managers to update career management skills and processes so that they can ensure that their team members understand their new roles and career options.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Training Manamgement ","description":"<p>Addresses your organization’s capability to ensure employees have the knowledge and skills necessary to perform their roles and comply with organizational policies and requirements.</p><p>Staff in your organization will need to frequently update the knowledge and skills required to implement and maintain cloud services. Training modalities may need to be revised so that the organization can embrace the speed of change and innovation. Trainers will need to develop new skills in training modalities and new processes for dealing with rapid change.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Organizational Change Management ","description":"","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2}]},{"header":"Governance","description":"","level":1,"child":[{"header":"<del>Portfolio Management</del> ","description":"<p>Focuses on your organization’s capability to manage and prioritize IT investments, programs, and projects in alignment with your organization’s business goals.</p><p>Portfolio Management is an important mechanism for determining cloud- eligibility for workloads and for prioritizing the move to cloud services. It serves as a focal point for lifecycle management of both applications and services. Teams will need to develop new skills and processes to evaluate cloud services and a workload’s eligibility for the cloud.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Program and Project Management ","description":"<p>Addresses your organization’s capability to manage one or several related projects to improve organizational performance and complete the projects on time and on budget.</p><p>Traditional waterfall methods of program and project management typically fail to keep up with the pace of iterative changes necessary for cloud adoption and operations. Program and Project Managers need to update their skills and processes to take advantage of the agility and cost management features of</p><p>cloud services. Teams need to develop new skills in agile project management</p><p>and new processes for managing agile-style projects.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Business Performance Measurement ","description":"<p>Addresses your organization’s capability to measure and optimize processes in support of your organization’s goals.</p><p>Cloud services offer the potential for organizations to rapidly experiment with new means of process automation and optimization. Leveraging this potential requires new skills and processes to define cloud-centric Key Performance Indicators (KPIs) and create processes to ensure cloud consumption is mapped to business outcomes.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"<del>License Mangement</del> ","description":"<p>Defines your organization’s capability to procure, distribute, and manage the licenses needed for IT systems, services, and software. The cloud consumption model requires that teams develop new skills for procurement and license management and new processes for evaluating license needs.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Information Governance ","description":"","level":2,"child":[{"header":"Manage Data Usage Purposes","description":"","level":3,"child":[]},{"header":"Manage Data Collection Policies","description":"","level":3,"child":[]},{"header":"Manage Data Sharing Policies","description":"","level":3,"child":[]},{"header":"Evaluate Data Protection Regulations","description":"<p>+ Compliances?</p>","level":3,"child":[]}],"badge":"New","badgeCategory":0,"switch_value":0}]},{"header":"Platform","description":"","level":1,"child":[{"header":"Compute Provisioning ","description":"<p>Encompasses your organization’s capability to provide processing and memory in support of enterprise applications. The skills and processes necessary to provision cloud services are very different from the skills and processes needed to provision physical hardware and manage data center facilities. Many processes move from being focused on real-world logistics to being focused on virtual and fully automated processes.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Network Provisioning ","description":"<p>Addresses your organization’s capability to provide computing networks to support enterprise applications.</p><p>Moving from hardware components to networks delivered as cloud services changes network provisioning significantly, and teams will need to develop new skills and processes to design, implement, and manage this transition.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Storage Provisioning ","description":"<p>Focuses on your organization’s capability to provide storage in support of enterprise applications.</p><p>Storage provisioning in the cloud is accomplished with cloud-based block and file storage. The skills and processes required to provision these services are significantly different from provisioning the physical storage area network (SAN), network-attached storage (NAS), and disk drives.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Database Provisioning ","description":"<p>Addresses your organization’s capability to provide database and database management systems in support of enterprise applications.</p><p>The skills and processes supporting this capability change significantly from managing hardware-bound and cost-bound databases to provisioning standard relational database management systems (RDMS) in the cloud and leveraging cloud-native databases.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Infrastructure Provisioning ","description":"","level":2,"child":[{"header":"Automate Infrastructure Management","description":"<p>> Infrastrcuture as a Code</p>","level":3,"child":[]}]},{"header":"Research and Development ","description":"","level":2,"child":[{"header":"Evaluate New Technologies","description":"","level":3,"child":[]},{"header":"Evaluate New Services","description":"","level":3,"child":[]}],"badge":"New","badgeCategory":0,"switch_value":0},{"header":"Systems and Solutions Architecture ","description":"<p>Encompasses your organization’s capability to define and describe the design of a system and to create architecture standards for the organization.</p><p>With cloud services, many of the traditional architectural aspects of systems change. Architects will need to develop new skills to codify architectures in templates and create new processes for workload optimization.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Application Development ","description":"<p>Defines your organization’s capability to customize or develop applications to support your organization’s business goals.</p><p>New skills and processes for Continuous Integration and Continuous Deployment (CI/CD) are a critical part of designing applications that take advantage of cloud services and the agility promised by cloud computing.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2}]},{"header":"Security","description":"","level":1,"child":[{"header":"Identity and Access Management ","description":"<p>This capability enables you to create multiple access control mechanisms and manage the permissions for each of these within your AWS Account. Privileges must be granted before your user community can provision or orchestrate resources.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Detectiv Control ","description":"<p>AWS provides the capability for native logging as well as services that you can leverage to provide greater visibility near to real time for occurrences in the AWS environment. Correlating the logs from AWS sources with other event sources like operating systems, applications, and databases can provide a robust security posture and enhance visibility.</p><p>Consider integrating AWS logging features into centralized logging and monitoring solutions to provide holistic visibility near to real time for occurrences in the AWS environment.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Infrastructure Security ","description":"<p>Your AWS environment can be defined and adjusted to evolve with your workload and business requirements. This capability provides the opportunity to shape your AWS security controls in an agile fashion; automating your ability to build, deploy, and operate your security infrastructure.</p><p>As new security features become available in AWS, it is important that your organization’s IT Security teams update their skills and processes so that they can leverage these new features.</p>","level":2,"child":[{"header":"Audit Security Posture","description":"","level":3,"child":[]},{"header":"Design Tenant Isolation Model","description":"","level":3,"child":[]},{"header":"Audit Tenant Isolation Model","description":"","level":3,"child":[]}],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"<del>Data Protection</del> ","description":"<p>Addresses the capability for maintaining visibility and control over data, and how it is accessed and used in the organization.</p><p>> Description reference the Governance, not security.</p><p>> Proposal: Information Security -</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Information Security ","description":"","level":2,"child":[],"badge":"New","badgeCategory":0,"switch_value":0},{"header":"Incident Response ","description":"<p>Focuses on your organization’s capability to respond, manage, reduce harm, and restore operations during and after a security incident. With AWS, you have services and independent software vendor (ISV) solutions available to help you automate incident response and recovery, and to mitigate portions of disaster recovery. As you implement your cloud security, it is possible to shift the primary focus of the security team from response to performing forensics and root cause analysis.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2}]},{"header":"Operations","description":"","level":1,"child":[{"header":"Business Operations ","description":"","level":2,"child":[{"header":"Manage Payments","description":"","level":3,"child":[]}],"badge":"New","badgeCategory":0,"switch_value":0},{"header":"Service Monitoring ","description":"<p>Addresses your organization’s capability to detect and respond to issues with the health of IT services and enterprise applications.</p><p>With cloud adoption, processes for both the detection of and response to service issues and application health issues can be highly automated, resulting in greater service uptime. Operations teams will need to develop new skills to leverage cloud features for service monitoring and automate many of their existing service monitoring processes.</p>","level":2,"child":[{"header":"Implement observability","description":"","level":3,"child":[]}],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Application Performance Monitoring ","description":"<p>Addresses your organization’s capability to ensure application performance meets its defined requirements.</p><p>Cloud services offer features to monitor and right-size the cloud services that you need to meet performance requirements. Operations teams need to update their skills and processes to ensure they are taking full advantage of these cloud features.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Resource Inventory Management ","description":"<p>Addresses the capability to align your organization’s assets in a way that provides the best, most cost-efficient service.</p><p>Cloud adoption removes the need to manage hardware assets and the hardware life cycle. Organizations can simplify the management of software licensing by leveraging on-demand techniques that optimize license usage. Operations teams will need to update their skills and processes to ensure they can manage cloud assets.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Release Management / Change Management ","description":"<p>Encompasses your organization’s capability to manage, plan, and schedule changes to the IT environment.</p><p>Traditional release management is a complex process that is slow to deploy and difficult to roll back. Cloud adoption provides the opportunity to leverage CI/CD techniques to rapidly manage releases and roll-backs.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Reporting and Analytics ","description":"<p>Addresses your organization’s capability to ensure compliance with your organization’s reporting policies and to ensure ongoing analysis and reporting of performance against key KPIs such as service-level agreements (SLAs) and operational-level agreements (OLAs).</p><p>With cloud adoption, operations teams need to update their skills and processes to ensure that they are taking advantage of new features to provide better detail and granularity in their reporting and analytics.</p>","level":2,"child":[{"header":"Manage Infrastructure Costs","description":"","level":3,"child":[]},{"header":"Report costs per tenant","description":"","level":3,"child":[]}],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"Business Continuinity / Disaster Recovery ","description":"<p>Addresses your organization’s capability to operate in the event of a significant failure of IT services and the capability to recover from those failures within the time parameters defined by your organization.</p><p>Many of the traditional BC/DR processes are significantly changed with cloud adoption and require operations teams to update their skills and capabilities to take advantage of the new models.</p>","level":2,"child":[{"header":"Identify Disaster Risks","description":"","level":3,"child":[]},{"header":"Define DR Strategy","description":"","level":3,"child":[]},{"header":"Practice DR Operations","description":"","level":3,"child":[]}],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"IT Service Catalog  ","description":"<p>IT Service Catalog is your organization’s capability to select, maintain, advertise, and deliver an SLA or set of IT services.</p><p>With cloud adoption, the IT Service Catalog serves as a control mechanism to ensure that your organization selects the services that provide the best business value while minimizing business risk. It becomes closely coupled with Portfolio Management in the Governance Perspective in order to ensure that technical services are aligned to business goals and needs.</p>","level":2,"child":[],"badge":"CAF","badgeCategory":2,"switch_value":2},{"header":"<del>Tenant Management</del>Multi Tenancy","description":"","level":2,"child":[{"header":"Provision Tenant","description":"","level":3,"child":[]},{"header":"Scale Individual Tenant","description":"","level":3,"child":[]},{"header":"Decommission Tenant ","description":"","level":3,"child":[]}]},{"header":"Customer Support","description":"","level":2,"child":[]}]},{"header":"CAF Perspective","description":"<p>Defines the core domains within the business.</p>","level":1,"child":[{"header":"Top Level Capability","description":"<p>Defines the collection of the actionable capabilities to fullfil a family of business operation.</p>","level":2,"child":[{"header":"Capability - [Verb]","description":"<p>Defines the \"what\" not \"how\", define the action to be practiced (verb).</p>","level":3,"child":[]}]}]}]